"""
题目：打印出所有的"水仙花数"，所谓"水仙花数"是指一个三位数，
其各位数字立方和等于该数本身。
例如：153是一个"水仙花数"，因为153=1的三次方＋5的三次方＋3的三次方。

程序分析：利用for循环控制100-999个数，每个数分解出个位，十位，百位。
"""
numbers = []
for num in range(100, 1000):
    # 三位数的 个位:i , 十位:j , 百位:k
    i = num % 10
    j = (num % 100) // 10
    k = num // 100
########### 整除的写法是//，而不是/ ，否则将自动转成float型计算!!! ############
    #   print(i, j, k)
    if num != (i ** 3 + j ** 3 + k ** 3):
########### **表示连乘几次这个数本身，i ** 3 ，就是 i 的三次方!!! ############
        continue
    else:
        numbers.append(num)
print(f"水仙花数，是这些数:{numbers}")
