# 学生信息字典的列表，表达很多个学生信息
print("*************************************** 学生信息字典列表 *****************************************")
students = {
    "小张": {"id": 101, "grade": 88},
    "小王": {"id": 102, "grade": 99},
    "小李": {"id": 103, "grade": 77},
    "小赵": {"id": 104, "grade": 86},
}
print(students)

print("**************************************** 更新小李的成绩 ***************************************")
# 将小李的成绩从77分改到87分
students["小李"]["grade"] = 87
print(students)

print("**************************************** 所有成绩降序输出 ****************************************")
# 将所有grade放到一个列表里，叫做grades
grades = []
for name, info in students.items():
    grades.append(info["grade"])

# 将grades降序排列后输出
grades.sort(reverse=True)
print(grades)
